BSP_EDT/src/Catalogs/Спец_ПодключаемоеОборудование/Спец_ПодключаемоеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Спец_ПодключаемоеОборудование</name>
  <attributes>
    <name>УстройствоИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДрайверОборудования</name>
    <type>
      <types>CatalogRef.Спец_ДрайверыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.Спец_РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПереустановка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПараметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BSP_EDT/src/Catalogs/Спец_ПодключаемоеОборудование/ObjectModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ВыборкаРезультат = ПолучитьВыборкуПоУстановленнымДрайверам();
	Если ВыборкаРезультат.Следующий() Тогда
		
		ТекстСообщения = СтрШаблон("По драйверу ""%1"" на рабочее место ""%2"" уже есть установленное оборудование - ""%3""!",
				ДрайверОборудования,
				РабочееМесто,
				ВыборкаРезультат.Ссылка);
		
		Спец_ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.ДрайверОборудования", , Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УстройствоИспользуется = Ложь;
	ДополнительныеПараметры.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//		* Ссылка - СправочникСсылка.Спец_ПодключаемоеОборудование
Функция ПолучитьВыборкуПоУстановленнымДрайверам()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Спец_ПодключаемоеОборудование.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Спец_ПодключаемоеОборудование КАК Спец_ПодключаемоеОборудование
	|ГДЕ
	|	Спец_ПодключаемоеОборудование.ДрайверОборудования = &ДрайверОборудования
	|	И Спец_ПодключаемоеОборудование.РабочееМесто = &РабочееМесто
	|	И Спец_ПодключаемоеОборудование.Ссылка <> &Ссылка
	|	И НЕ Спец_ПодключаемоеОборудование.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДрайверОборудования", ДрайверОборудования);
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти

#Иначе

	ВызватьИсключение "Недопустимый вызов объекта на клиенте."

#КонецЕсли
